Tekla Open API Reference for Tekla Structures 2025
GraphicObjectAttributes Constructor
Overload List
Name | Description
GraphicObject.GraphicObjectAttributes()
 Creates a new graphic object attributes instance.
GraphicObject.GraphicObjectAttributes(String)
 Creates a new graphic object attributes instance using the given attribute file's filename.
Top
See Also
Reference
GraphicObject.GraphicObjectAttributes Class
Tekla.Structures.Drawing Namespace